# Q1. 학급 성적 관리 시스템
# 난이도: ⭐⭐
# 관련 문법: 딕셔너리, 리스트, 반복문
# 문제: 학생 이름(Key)과 3과목 점수 리스트(Value)가 담긴 딕셔너리가 주어집니다. 
# 각 학생의 평균 점수를 계산하여 80점 이상이면 'Pass', 미만이면 'Fail'로 분류한 새로운 결과 딕셔너리를 생성하세요.

students = {
    '홍길동': [85, 92, 78]
}

result = {}

for name, scores in students.items():
    avg = sum(scores) / len(scores)
    
    if avg >= 80:
        result[name] = 'Pass'
    else:
        result[name] = 'Fail'

print(result)

# Q2. 쇼핑 장바구니 중복 제거 및 합계
# 난이도: ⭐⭐
# 관련 문법: 리스트, 집합(Set), 딕셔너리
# 문제: 고객이 담은 상품 리스트에 중복이 포함되어 있습니다. set을 이용해 중복을 제거하고, 
# 각 상품별 가격표(딕셔너리)를 참조하여 총 결제 금액을 출력하세요.
cart = ["사과","바나나","사과","우유"]

prices = {
    "사과":2000,
    "바나나":2000,
    "우유":2500
}

Deduplication = set(cart)

total = 0
for Q2 in Deduplication:
    total += prices[Q2]

print("총 결제 금액:", total)

# Q3. 단어 빈도수 측정기 (NLP 기초)
# 난이도: ⭐⭐⭐
# 관련 문법: 문자열 처리, 딕셔너리, 조건문
# 문제: 주어진 문장에서 공백을 기준으로 단어를 분리하세요. 
# 마침표(.)나 콤마(,)는 제거한 뒤, 각 단어가 몇 번 등장했는지 카운트하여 딕셔너리에 저장하세요.



# Q4. 영화 예매 좌석 현황판
# 난이도: ⭐⭐⭐
# 관련 문법: 중첩 리스트(2차원 배열), 입력(input)
# 문제: $5 \times 5$ 크기의 2차원 리스트(0은 빈 좌석, 1은 예약됨)를 만듭니다.
# 사용자로부터 행/열 번호를 입력받아 빈 좌석이면 1로 변경하고, 이미 예약된 곳이면 "이미 예약된 좌석입니다"를 출력하세요.



# Q5. 로또 번호 생성 및 당첨 확인
# 난이도: ⭐⭐⭐
# 관련 문법: random 모듈, 집합(Set), 튜플
# 문제: 1~45 사이의 중복 없는 숫자 6개를 생성하여 집합에 저장합니다.
# 사용자가 입력한 숫자 6개(튜플)와 비교하여 몇 개의 숫자가 일치하는지 계산하세요.



# Q6. 주식 수익률 데이터 필터링
# 난이도: ⭐⭐⭐
# 관련 문법: 리스트 내 딕셔너리, 반복문, 산술 연산
# 문제: [{'date': '2023-10-01', 'price': 100}, ...] 형태의 리스트 데이터에서 전날보다 가격이 상승한 날의 데이터만 추출하여 새로운 리스트를 만들고 전체 평균가를 구하세요.



# Q7. 회원 가입 ID 유효성 검사
# 난이도: ⭐⭐
# 관련 문법: 리스트, 조건문, 논리 연산자
# 문제: 새로 가입하려는 ID 리스트가 있습니다.
# 기존 회원 ID 리스트와 중복되지 않아야 함.
# ID 길이가 5자 이상이어야 함.
# 위 두 조건을 만족하는 ID만 '승인' 리스트에 추가하는 코드를 작성하세요.




# Q8. 편의점 재고 관리 시스템
# 난이도: ⭐⭐⭐⭐
# 관련 문법: 딕셔너리 업데이트, 튜플 순회
# 문제: 현재 재고 딕셔너리 {상품명: 수량}이 있습니다. 
# 판매 내역 리스트 [ (상품명, 수량), ... ]를 순회하며 재고를 차감하세요. 단, 재고가 부족할 경우 "재고 부족"을 출력하고 
# 해당 상품은 차감하지 않습니다.



# Q9. 사용자 간 취향 유사도 분석
# 난이도: ⭐⭐
# 관련 문법: 집합(Set) 연산 (교집합, 합집합, 차집합)
# 문제: 두 사용자 A와 B가 시청한 영화 리스트가 각각 주어집니다.
# 두 사람의 공통 영화 목록
# 두 사람 중 한 명이라도 본 영화 전체 목록
# A만 보고 B는 보지 않은 영화 목록을 각각 구하세요.




# Q10. 학생 전공별 그룹화 (Group By)
# 난이도: ⭐⭐⭐⭐
# 관련 문법: 딕셔너리, 리스트, 튜플
# 문제: (이름, 전공, 연락처) 튜플들이 담긴 리스트가 있습니다. 
# 이를 전공(Key)별로 학생 이름 리스트(Value)가 들어있는 딕셔너리 형태로 재구성하세요.
# 예: {'컴공': ['홍길동', '김철수'], '경영': ['이영희']}





